jmeter.log
2017/03/29 23:49:10 INFO  - jmeter.util.JMeterUtils: Setting Locale to en_US 
2017/03/29 23:49:10 INFO  - jmeter.JMeter: Loading user properties from: /usr/share/jmeter/bin/user.properties 
2017/03/29 23:49:10 INFO  - jmeter.JMeter: Loading system properties from: /usr/share/jmeter/bin/system.properties 
2017/03/29 23:49:10 INFO  - jmeter.JMeter: Copyright (c) 1998-2015 The Apache Software Foundation 
2017/03/29 23:49:10 INFO  - jmeter.JMeter: Version 2.13.20160427 
2017/03/29 23:49:10 INFO  - jmeter.JMeter: java.version=1.8.0_121 
2017/03/29 23:49:10 INFO  - jmeter.JMeter: java.vm.name=OpenJDK 64-Bit Server VM 
2017/03/29 23:49:10 INFO  - jmeter.JMeter: os.name=Linux 
2017/03/29 23:49:10 INFO  - jmeter.JMeter: os.arch=amd64 
2017/03/29 23:49:10 INFO  - jmeter.JMeter: os.version=4.8.0-22-generic 
2017/03/29 23:49:10 INFO  - jmeter.JMeter: file.encoding=UTF-8 
2017/03/29 23:49:10 INFO  - jmeter.JMeter: Default Locale=English (United States) 
2017/03/29 23:49:10 INFO  - jmeter.JMeter: JMeter  Locale=English (United States) 
2017/03/29 23:49:10 INFO  - jmeter.JMeter: JMeterHome=/usr/share/jmeter 
2017/03/29 23:49:10 INFO  - jmeter.JMeter: user.dir  =/home/tarrant/go/src/github.com/xiaoyao1991/chukonu 
2017/03/29 23:49:10 INFO  - jmeter.JMeter: PWD       =/home/tarrant/go/src/github.com/xiaoyao1991/chukonu 
2017/03/29 23:49:10 INFO  - jmeter.JMeter: IP: 127.0.1.1 Name: tarrantLaptop FullName: tarrantLaptop 
2017/03/29 23:49:10 INFO  - jmeter.services.FileServer: Default base='/home/tarrant/go/src/github.com/xiaoyao1991/chukonu' 
2017/03/29 23:49:10 INFO  - jmeter.services.FileServer: Set new base='/home/tarrant/go/src/github.com/xiaoyao1991/chukonu' 
2017/03/29 23:49:10 INFO  - jmeter.save.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2 
2017/03/29 23:49:10 INFO  - jmeter.save.SaveService: Using SaveService properties file encoding UTF-8 
2017/03/29 23:49:10 INFO  - jmeter.save.SaveService: Using SaveService properties file version 1656252 
2017/03/29 23:49:10 INFO  - jmeter.save.SaveService: Using SaveService properties version 2.8 
2017/03/29 23:49:10 INFO  - jmeter.save.SaveService: All converter versions present and correct 
2017/03/29 23:49:10 INFO  - jmeter.save.SaveService: Loading file: druid.jmx 
2017/03/29 23:49:10 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Cannot find .className property for htmlParser, using default 
2017/03/29 23:49:10 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for text/html is  
2017/03/29 23:49:10 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for application/xhtml+xml is  
2017/03/29 23:49:10 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for application/xml is  
2017/03/29 23:49:10 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for text/xml is  
2017/03/29 23:49:10 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser 
2017/03/29 23:49:10 INFO  - jmeter.JMeter: Creating summariser <summary> 
2017/03/29 23:49:10 INFO  - jmeter.engine.StandardJMeterEngine: Listeners will be started after enabling running version 
2017/03/29 23:49:10 INFO  - jmeter.engine.StandardJMeterEngine: To revert to the earlier behaviour, define jmeterengine.startlistenerslater=false 
2017/03/29 23:49:10 INFO  - jmeter.engine.StandardJMeterEngine: Running the test! 
2017/03/29 23:49:10 INFO  - jmeter.samplers.SampleEvent: List of sample_variables: [] 
2017/03/29 23:49:10 INFO  - jmeter.samplers.SampleEvent: List of sample_variables: [] 
2017/03/29 23:49:10 INFO  - jmeter.engine.util.CompoundVariable: Note: Function class names must contain the string: '.functions.' 
2017/03/29 23:49:10 INFO  - jmeter.engine.util.CompoundVariable: Note: Function class names must not contain the string: '.gui.' 
2017/03/29 23:49:10 INFO  - jmeter.JMeter: Running test (1490849350884) 
2017/03/29 23:49:10 INFO  - jmeter.engine.StandardJMeterEngine: Starting ThreadGroup: 1 : Thread Group 
2017/03/29 23:49:10 INFO  - jmeter.engine.StandardJMeterEngine: Starting 10 threads for group Thread Group. 
2017/03/29 23:49:10 INFO  - jmeter.engine.StandardJMeterEngine: Thread will continue on error 
2017/03/29 23:49:10 INFO  - jmeter.threads.ThreadGroup: Starting thread group number 1 threads 10 ramp-up 1 perThread 100.0 delayedStart=false 
2017/03/29 23:49:10 INFO  - jmeter.threads.JMeterThread: jmeterthread.startearlier=true (see jmeter.properties) 
2017/03/29 23:49:10 INFO  - jmeter.threads.JMeterThread: Running PostProcessors in forward order 
2017/03/29 23:49:10 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-1 
2017/03/29 23:49:10 INFO  - jmeter.threads.ThreadGroup: Started thread group number 1 
2017/03/29 23:49:10 INFO  - jmeter.engine.StandardJMeterEngine: All thread groups have been started 
2017/03/29 23:49:10 INFO  - jmeter.protocol.http.sampler.HTTPHCAbstractImpl: Local host = tarrantLaptop 
2017/03/29 23:49:10 INFO  - jmeter.protocol.http.sampler.HTTPHC4Impl: HTTP request retry count = 0 
2017/03/29 23:49:10 INFO  - jmeter.protocol.http.sampler.HTTPHC4Impl: Setting up HTTPS TrustAll scheme 
2017/03/29 23:49:10 INFO  - jmeter.util.JsseSSLManager: Using default SSL protocol: TLS 
2017/03/29 23:49:10 INFO  - jmeter.util.JsseSSLManager: SSL session context: per-thread 
2017/03/29 23:49:11 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-2 
2017/03/29 23:49:11 INFO  - jmeter.samplers.SampleResult: Note: Sample TimeStamps are START times 
2017/03/29 23:49:11 INFO  - jmeter.samplers.SampleResult: sampleresult.default.encoding is set to ISO-8859-1 
2017/03/29 23:49:11 INFO  - jmeter.samplers.SampleResult: sampleresult.useNanoTime=true 
2017/03/29 23:49:11 INFO  - jmeter.samplers.SampleResult: sampleresult.nanoThreadSleep=5000 
2017/03/29 23:49:11 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-3 
2017/03/29 23:49:11 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-4 
2017/03/29 23:49:11 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-5 
2017/03/29 23:49:11 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-6 
2017/03/29 23:49:11 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-7 
2017/03/29 23:49:11 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-8 
2017/03/29 23:49:11 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-9 
2017/03/29 23:49:11 INFO  - jmeter.threads.JMeterThread: Thread started: Thread Group 1-10 
2017/03/29 23:49:17 INFO  - jmeter.threads.JMeterThread: Thread is done: Thread Group 1-8 
2017/03/29 23:49:17 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-8 
2017/03/29 23:49:17 INFO  - jmeter.threads.JMeterThread: Thread is done: Thread Group 1-10 
2017/03/29 23:49:17 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-10 
2017/03/29 23:49:18 INFO  - jmeter.threads.JMeterThread: Thread is done: Thread Group 1-6 
2017/03/29 23:49:18 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-6 
2017/03/29 23:49:18 INFO  - jmeter.threads.JMeterThread: Thread is done: Thread Group 1-9 
2017/03/29 23:49:18 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-9 
2017/03/29 23:49:20 INFO  - jmeter.threads.JMeterThread: Thread is done: Thread Group 1-7 
2017/03/29 23:49:20 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-7 
2017/03/29 23:49:21 INFO  - jmeter.threads.JMeterThread: Thread is done: Thread Group 1-3 
2017/03/29 23:49:21 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-3 
2017/03/29 23:49:21 INFO  - jmeter.threads.JMeterThread: Thread is done: Thread Group 1-4 
2017/03/29 23:49:21 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-4 
2017/03/29 23:49:22 INFO  - jmeter.threads.JMeterThread: Thread is done: Thread Group 1-5 
2017/03/29 23:49:22 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-5 
2017/03/29 23:49:23 INFO  - jmeter.threads.JMeterThread: Thread is done: Thread Group 1-1 
2017/03/29 23:49:23 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-1 
2017/03/29 23:49:25 INFO  - jmeter.threads.JMeterThread: Thread is done: Thread Group 1-2 
2017/03/29 23:49:25 INFO  - jmeter.threads.JMeterThread: Thread finished: Thread Group 1-2 
2017/03/29 23:49:25 INFO  - jmeter.engine.StandardJMeterEngine: Notifying test listeners of end of test 
2017/03/29 23:49:25 INFO  - jmeter.reporters.Summariser: summary =    100 in    15s =    6.7/s Avg:   932 Min:   226 Max: 10448 Err:     0 (0.00%)